[
  {
    "title": "Age of Seraphs",
    "featured": true,
    "image": "https://github.com/WatermelonFrogy/watermelonfrogy.github.io/blob/main/images/projects/ageofseraphs.png?raw=true",
    "description": "A rich, medium-fantasy civilization-building Vintage Story server where players guide seraphs to explore, settle, and shape the world. Featuring deep political intrigue, city planning, and community-driven storytelling, the server blends semi-realism with fun progression mechanics.",
    "tags": [
      "Vintage Story",
      "Community Management & Engagement",
      "C#",
      "Creative Direction",
      "Team Collaboration",
      "Server Hosting"
    ],
    "features": [
      "Guide friends and players to build and expand civilizations",
      "Engage in political intrigue and diplomacy",
      "Plan and design cities with strategic layouts",
      "Participate in community-driven storytelling"
    ],
    "timeline": "December 2024 - Current",
    "role": "Founder, Owner",
    "link": "https://discord.gg/ageofseraphs",
    "source": null
  },
  {
    "title": "Respawn",
    "featured": false,
    "image": "https://github.com/WatermelonFrogy/watermelonfrogy.github.io/blob/main/images/projects/Respawn.png?raw=true",
    "description": "\"Respawn\" is a spiritual successor to A Township Tale built in Godot with the goal of having open-source modding tools while being created out of genuine love for the original game and the community it inspired. The goal isn’t to imitate its flaws, but to recapture the feeling it gave, collaborative exploration, tactile crafting, and the warmth of a living world shared with friends. Respawn focuses on satisfying physics interactions, expressive VR hand presence, and an inviting co-op world where players build, craft, explore, and grow together. It aims to preserve what made A Township Tale magical while forging its own identity along the way.",
    "tags": ["Godot Engine", "GDScript", "Multiplayer", "VR Development", "Game Design"],
    "features": [
      "Standalone VR, PCVR, and traditional PC crossplay",
      "High-fidelity physics-based hand and item interactions",
      "Immersive crafting, gathering, and smithing systems",
      "Explorable shared hub-world inspired by early ATT servers",
      "Dedicated multiplayer with persistent player progress",
      "Warm, community-focused world design built around cooperation"
    ],
    "timeline": "December 2025 – In Development",
    "role": "Sole Developer",
    "link": "#contact",
    "source": null
  },
  {
    "title": "Tower of Bagel",
    "featured": false,
    "image": "https://img.itch.zone/aW1nLzE3NDI2MjQzLnBuZw==/347x500/ipUOnF.png",
    "description": "A \"Tower-Defense-Meets-Roguelike\" strategy game developed for the GMTK Game Jam 2024 in Godot. The theme was \"Built to Scale.\" This was my first published game and a crucial learning experience in rapid prototyping. The core gameplay revolves around building and managing the multi-layered \"Tower of Bagel\", requiring the player to carefully plan resource allocation for each layer's purpose while defending against external threats at night. Due to initial scope struggles, nearly 90% of the code was written in the final three days before the deadline, resulting in an unpolished but interesting project.",
    "tags": ["Godot Engine", "GDScript", "Game Jam", "Team Collaboration"],
    "features": [
      "Designed for the GMTK Game Jam theme \"Built to Scale\" through layered tower construction",
      "Slow-paced strategy focusing on layered tower management",
      "Careful resource allocation and planning",
      "Defense against nightly external threats"
    ],
    "timeline": "August 2024 (GMTK Game Jam)",
    "role": "Programmer (Core Logic, Tower Building, Resource Management)",
    "link": "https://mishamol.itch.io/tower-of-bagel",
    "source": null
  } 
]